app/Controllers/Artikel.php

SELECT *
FROM `artikel`
WHERE `judul` LIKE '%php%' ESCAPE '!'
OR  `isi` LIKE '%php%' ESCAPE '!'
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `judul` LIKE '%php%' ESCAPE '!'
OR  `isi` LIKE '%php%' ESCAPE '!'
SELECT *
FROM `artikel`
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `artikel`
---
   public function index()
{
    $keyword = $this->request->getGet('q');

    if ($keyword) {
        $artikel = $this->artikelModel
            ->like('judul', $keyword)
            ->orLike('isi', $keyword)
            ->paginate(6, 'artikel');
    } else {
        $artikel = $this->artikelModel->paginate(6, 'artikel');

SELECT *
FROM `artikel`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `artikel`
---
    public function admin_index()
    {
        $data = [
            'title'   => 'Halaman Admin - Artikel',
            'artikel' => $this->artikelModel->paginate(10, 'artikel'),
            'pager'   => $this->artikelModel->pager
        ];